{"_id":{"$oid":"61090ca587a5478cc71f643c"},"product_url":"https://www.finishline.com/store/product/crocs-x-space-jam-classic-all-terrain-clog-shoes/prod2832955?styleId=207424\u0026colorId=074","product_name":"Crocs x Space Jam Classic All-Terrain Clog Shoes","price":"$65.00","color":["Black","Black"],"size":["4.0","5.0","6.0","7.0","8.0","9.0","10.0","11.0","12.0","13.0"],"image_url":"https://media.finishline.com/i/finishline/207424_074_P1?$default$","description":"Sizing InformationThese Crocs are available in men's and big kids' sizes, but women can wear them, too!Women: Select 2 sizes down from your typical shoe size for the most comfortable fitExample: If you wear a 9 in Women's, select a 7 in this clogProduct FeaturesSpace Jam-inspired design for nostalgic styleSuper lightweight and roomyCroslite foam cushioning for all-day comfortWater-friendly and buoyantPorts at the toebox for ventilated breathabilityPerforations on the toebox for ventilationMovable heel strap locks you inWipe cleanThe Crocs x Space Jam Classic All-Terrain is imported.Get a heavy dose of comfort and nostalgia with the Crocs x Space Jam Classic All-Terrain Clog Shoes. With colors and graphics inspired by the Space Jam franchise, these all-terrain clogs ensure you have out-of-this-galaxy comfortability off-the-court."}
{"_id":{"$oid":"61090ca587a5478cc71f643d"},"product_url":"https://www.finishline.com/store/product/mens-nike-air-force-1-07-casual-shoes/prod2767626?styleId=CT2302\u0026colorId=002","product_name":"Men's Nike Air Force 1 '07 Casual Shoes","price":"$90.00","color":["Black/White","Black/White"],"size":["6.0","6.5","7.0","7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","13.0","14.0","15.0","16.0","17.0","18.0"],"image_url":"https://media.finishline.com/i/finishline/CT2302_002_P1?$default$","description":"Classic leather and textile upperStrategically placed overlays for premium durability, fit and supportPerforations throughout for enhanced ventilationFull-length, encapsulated Nike Air unit for lightweight cushioningPolyurethane (PU) midsole for durability and cushioningNon-marking rubber cupsole for traction and durabilityThe Nike Air Force 1 '07 is importedThe Men's Nike Air Force 1 '07 Casual Shoes are furthering the legacy of the iconic AF1. By blending the classic design with modern technology, you get an all-new comprehensive model."}
{"_id":{"$oid":"61090ca587a5478cc71f643e"},"product_url":"https://www.finishline.com/store/product/mens-puma-mirage-tech-casual-shoes/prod2823349?styleId=38111803\u0026colorId=060","product_name":"Men's Puma Mirage Tech Casual Shoes","price":"$90.00","color":["White/Black/Blue/Yellow","White/Black/Blue/Yellow","Grey Violet/Puma White","Shifting Sand/Brush/Pheasant","Castlerock/Elektro Green","Black/Red","White/Black","Puma White/Puma Black","Puma Black/Puma White"],"size":["7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","13.0","14.0","6.5","7.0"],"image_url":"https://media.finishline.com/i/finishline/38111803_060_P1?$default$","description":"Retro-running silhouette is sleek and stylishMesh upper with overlays for stabilityLow-top, lace-up silhouetteCushioned comfort midsoleDurable traction outsole for gripThe Puma Mirage Tech is imported.Inspired by runners from yesteryear and boasting plenty of street style for the sneaker enthusiast in you, the Men's Puma Mirage Tech Running Shoes are perfectly paired with jeans or joggers for an elevated look that brings the comfort."}
{"_id":{"$oid":"61090de40090090426e22ba8"},"product_url":"https://www.finishline.com/store/product/mens-nike-air-max-270-casual-shoes/prod2770900?styleId=AH8050\u0026colorId=100","product_name":"Men's Nike Air Max 270 Casual Shoes","price":"$150.00","color":["White/White/Black","White/White/Black","Black/Anthracite/White/Solar Red","University Red/University Red/Black","Black/Aquamarine/Green Strike/White",""],"size":["6.0","6.5","7.0","7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","12.5","13.0","14.0","15.0"],"image_url":"https://media.finishline.com/i/finishline/AH8050_100_P1?$default$","description":"Men's Nike Air Max 270 Casual Shoes:The first of its kind, the Men's Nike Air Max 270 Casual Shoes boast a Max Air unit created specifically for Nike Sportswear. Updated with the luxuries of modern comfort, the Air Max 270 features a vintage-inspired exaggerated tongue and heritage tongue logo, both of which are a direct nod to the original 1991 Air Max 180. This fresh model was almost dubbed the Air Max 273 – a mathematical nod to the Air Max 180 + 93. But, the silhouette was changed to the 270, representing all 270 degrees of visible Air on the heel. Experience old school details and modern-day comfort when you slip into these soon-to-be classics.Add one of the newest additions to the Nike Air Max family to your collection today, with the Nike Air Max 270 Casual Shoes. Big, bold and brash, experience comfort with every step when you rock this exaggerated silhouette.Nike Air Max 270 Features:RUNS SMALL: Consider sizing up for a more comfortable fitEngineered mesh in the forefoot, mono-mesh in the quarter for enhanced breathability and ventilationDesign lines, tongue logo and exaggerated tongue top reminiscent of the original Air Max 180Neoprene bootie construction for a snug and secure fit3-piece midsole provides a smooth rideLarge volume Max Air unit for light, responsive cushioningRubber toe tip for added durabilityThe Nike Air Max 270 is imported"}
{"_id":{"$oid":"61091021098d91f62da808a9"},"product_url":"https://www.finishline.com/store/product/mens-nike-tanjun-casual-shoes/prod1500184?styleId=812654\u0026colorId=001","product_name":"Men's Nike Tanjun Casual Shoes","price":"$65.00","color":["Black/Anthracite","Black/Anthracite","Wolf Grey/White"],"size":["7.0","7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","13.0","14.0"],"image_url":"https://media.finishline.com/i/finishline/812654_001_P1?$default$","description":"Enjoy lightweight breathability in the textile Men's Nike Tanjun Casual Shoes.Lightweight and flexible low-cut designPlush full-length injected unitPremium traction from the rubber waffle outsoleThe Nike Tanjun is importedIn Japanese \"tanjun\" means \"simplicity,\" and that's exactly what the Men's Nike Tanjun Casual Shoes embody. Sport this light, flexible design with your favorite joggers or flat front shorts and prepare for the compliments."}
{"_id":{"$oid":"610912400d7d525f582d4c01"},"product_url":"https://www.finishline.com/store/product/mens-puma-suede-classic-21-casual-shoes/prod2823679?styleId=37491504\u0026colorId=400","product_name":"Men's Puma Suede Classic 21 Casual Shoes","price":"$70.00","color":["Navy/Puma White","Navy/Puma White","Grey Violet/Puma White","Puma Black/Puma White","Red/Puma White","Black/Black"],"size":["7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","13.0","14.0"],"image_url":"https://media.finishline.com/i/finishline/37491504_400_P1?$default$","description":"Sizing InformationThese shoes are equal to men's shoe sizingWomen, select 1.5 sizes smaller than your typical shoe sizeEx. If you wear a women's size 10, you would select an 8.5 in this sneakerProduct FeaturesClassic low-profile silhouetteSuede upper with synthetic liningLace-up closureComfortable socklinerRubber midsole and outsoleThe Puma Suede Classic 21 is imported.The first trainer from Puma hit the ground in 1968 and the powerhouse brand hasn’t looked back since. The newest iteration, the Men's Puma Suede Classic 21 Casual Shoes, boasts a full suede upper and modern touches that bring it into this century."}
{"_id":{"$oid":"610912400d7d525f582d4c02"},"product_url":"https://www.finishline.com/store/product/crocs-classic-lined-clog-shoes/prod19900001?styleId=206341M\u0026colorId=421","product_name":"Crocs Classic Lined Clog Shoes","price":"$65.00","color":["Tie-Dye","Tie-Dye","Black/Black","Mineral Blue","White/Grey","Lavender","Lemon","Espresso/Walnut","","","Tie-Dye"],"size":["4.0","5.0","6.0","7.0","8.0","9.0","10.0","11.0","12.0","13.0","2.0","3.0","14.0","15.0"],"image_url":"https://media.finishline.com/i/finishline/206341M_421_P1?$default$","description":"Shop All Crocs Jibbitz™ charmsto personalize your Crocs!Sizing InformationUNISEX SIZING: Unisex shoes are equal to men's shoe sizingWomen, select 1.5 sizes smaller than your typical shoe sizeEx. If you wear a women's size 10, you would select an 8.5 in this sneakerMen and Big Kids, select your typical shoe sizeProduct FeaturesDepending on the style, Crocs may be one-color, tie-dye, glitter or feature graphic printsSuper lightweight and roomyFoam cushioning for all day comfortPlush, fuzzy lining for warmthPorts at the toebox for ventilated breathabilityMovable heel strap locks you inWipe cleanThe Crocs Classic Lined Clog is imported.The classic Crocs you know and love get a comfort boost on the Crocs Classic Lined Clogs. Featuring a plush, fuzzy liner, these versatile shoes are ultra cozy. Pair the tie-dye version up with your favorite joggers for a weekend in the house, rock glitter colorways with your favorite standout street 'fit or simply rock classic one-color Crocs for your everyday needs."}
{"_id":{"$oid":"610912cf1940a08191ac472d"},"product_url":"https://www.finishline.com/store/product/mens-nike-air-force-1-low-casual-shoes/prod795980?styleId=315122\u0026colorId=111","product_name":"Men's Nike Air Force 1 Low Casual Shoes","price":"$90.00","color":["White/White","White/White"],"size":["6.0","6.5","7.0","7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","12.5","13.0","14.0","15.0","16.0","17.0","18.0","19.0"],"image_url":"https://media.finishline.com/i/finishline/315122_111_P1?$default$","description":"Men's Nike Air Force 1 Low Casual Shoes:Making its way onto the hardwood in 1982, the Nike Air Force 1 was the first shoe featuring the now-iconic Nike Air cushioning. Step up your style game when you step out in the cult-like classic AF1 sneakers from Nike and experience the head-turning style that’s made its way through pop culture for decades. Being an icon isn’t easy, but the Nike Air Force 1 Casual Shoes help you along the way. Named after the United States President’s personal air craft carrier fleet, these sneakers have been, and continue to remain, a true leader in the footwear industry.Are you ready to take your street style to the next level? Slip into a pair of Air Force 1 Low sneakers today and experience the silhouette that changed the sneaker game infinitely.Nike Air Force 1 Low Features:Premium full-grain leather upper on the Air Force 1 LowPerforations for enhanced ventilationPadded collar for a snug and secureFoam midsole with Nike Air unit for lightweight cushioningPivot points in the forefoot allow for smooth transitions in all directionsNon-marking rubber outsole for durable tractionThe Nike Air Force 1 Low is imported"}
{"_id":{"$oid":"610914e8fd1f9a1ae0eba30a"},"product_url":"https://www.finishline.com/store/product/mens-nike-air-max-2015-running-shoes/prod2787953?styleId=CN0135\u0026colorId=001","product_name":"Men's Nike Air Max 2015 Running Shoes","price":"$180.00","color":["Black/Volt/Wolf Grey","Black/Volt/Wolf Grey","White/Black","Cool Grey/Black/Bright Crimson","Red/Black"],"size":["7.0","7.5","8.0","8.5","9.0","9.5","10.0","10.5","11.0","11.5","12.0","12.5","13.0","14.0","15.0"],"image_url":"https://media.finishline.com/i/finishline/CN0135_001_P1?$default$","description":"Stellar performance on the Nike Air Max 2015Seamless engineered upperFlywire technologySock-like internal bootie constructionFull-length Max Air unit for comfortFlexible rubber outsole with traction pattern for gripThe Nike Air Max 2015 is imported.Rock the Men's Nike Air Max 2015 Running Shoes for an everyday sneaker that has endless possibilities."}
{"_id":{"$oid":"610915c129c81edd8af50dca"},"product_url":"https://www.finishline.com/store/product/mens-adidas-adilette-cloudfoam-plus-slide-sandals/prod2776362?styleId=AP9971\u0026colorId=BLK","product_name":"Men's adidas Adilette Cloudfoam Plus Slide Sandals","price":"$35.00","color":["Core Black/Cloud White","Core Black/Cloud White","Black/Black/White","Black/Black/Black","Core Black/Gold Metallic/Core Black","Black/Grey Camo","Black/White/White"],"size":["4.0","5.0","6.0","7.0","8.0","9.0","10.0","11.0","12.0","13.0","14.0","15.0","16.0","17.0","18.0"],"image_url":"https://media.finishline.com/i/finishline/AP9971_BLK_P1?$default$","description":"Single-bandage synthetic upperIconic 3-Stripes across the upperTextile liningCloudfoam Plus footbed for pillowy cushioningContoured footbed conforms to shape of your footThe adidas Adilette Cloudfoam Plus is importedPut your feet on cloud nine with the Men's adidas Adilette Cloudfoam Plus Slide Sandals."}
